 
package com.lixuan.rems.service;

import java.util.List;

import com.lixuan.rems.util.PageBean;
import com.lixuan.rems.util.QueryHelper;

/**  
 * ClassName:ServiceSupport   
 * Date:     2016年1月20日 下午7:32:40  
 * @author   CAOPENG  
 * @version  1.0 
 * @since    JDK 1.7  
 * @right    Copyright (c) 2016, lixuan.com All Rights Reserved.   
 * @see        
 */
	public interface BaseService<T>
	{
		/********************************************************************************
	     * 保存实体
	     * 
	     * @param entity
	     ********************************************************************************/
	    void save(T entity);
	    

	    /********************************************************************************
	     * 保存或更新实体
	     * 
	     * @param entity
	     ********************************************************************************/
	    void saveOrUpdate(T entity);

	    /********************************************************************************
	     * 删除实体
	     * 
	     * @param id
	     ********************************************************************************/
	    void delete(Long id) throws Exception;
	    
	    /********************************************************************************
	     * 根据提供的id数组删除符合条件的实体
	     * 
	     * @param id
	     ********************************************************************************/
	    void delete(Long[] ids) throws Exception;

	    /********************************************************************************
	     * 更新实体
	     * 
	     * @param entity
	     ********************************************************************************/
	    void update(T entity);

	    /********************************************************************************
	     * 按id查询
	     * 
	     * @param id
	     * @return
	     ********************************************************************************/
	    T getById(Long id);

	    /********************************************************************************
	     * 按id数组查询对象集合
	     * 
	     * @param ids
	     * @return
	     ********************************************************************************/
	    List<T> getByIds(Long[] ids);

	    /********************************************************************************
	     * 查询所有
	     * 
	     * @return
	     ********************************************************************************/
	    List<T> findAll();

	    /********************************************************************************
	     * 根据提供的查询参数，查询符合条件的对象集合
	     * @param queryHelper:HQL语句与参数列表
	     * @return
	     ********************************************************************************/
	    List<T> getByQueryHelper(QueryHelper queryHelper);
	    
	    /********************************************************************************
	     * 公共的查询分页信息的方法
	     * 
	     * @param pageNum:当前页号码
	     * @param pageSize:每页数据量
	     * @param queryHelper:HQL语句与参数列表
	     * @return
	     ********************************************************************************/
	    PageBean getPageBean(int pageNum, int pageSize, QueryHelper queryHelper);
}
  
